#pragma once

//NOTE: Contains definitions to help identify the compiler used


#ifdef __clang__
    #define COMP_CLANG 1
    #define COMP_GCC   0
#elif defined(__GNUC__)
    #define COMP_CLANG 0
    #define COMP_GCC   1
#else
    #error "Compiler not supported"
#endif

#include <assert.h>

#if COMP_CLANG
    #define STATIC_ASSERT(a, m) static_assert(a, m)

    #if __has_builtin(__builtin_debugtrap)
        #define DEBUG_BRK()     __builtin_debugtrap()
    #else
        #include <stdlib.h>
        #define DEBUG_BRK()     abort()
    #endif
#elif COMP_GCC
    #define STATIC_ASSERT(a, m) _Static_assert(a, m)

    #if defined(SIGTRAP)
        #if SYSTEM_POSIX
            #define DEBUG_BRK() raise(SIGTRAP)
        #endif
    #else
        #include <stdlib.h>
        #define DEBUG_BRK()     abort()
    #endif
#endif


//NOTE: This header file contains defines used to determine the system on which this program is being compiled on

// Is a posix system ?
#if defined(__unix__) || (defined (__APPLE__) && defined ( __MACH__) )
    #define SYSTEM_POSIX    1
#else
    #define SYSTEM_POSIX    0
#endif

#if defined(_WIN32) && defined (_WIN64)
    #define SYSTEM_WINDOWS  1
    #define SYSTEM_NAME     "Windows 64-bit"
#elif defined(_WIN32) && !defined(_WIN64)
    #error "Only Windows 64bit is supported"
#else
    #define SYSTEM_WINDOWS  0
#endif

#if defined(__APPLE__) && defined (__MACH__)
    #define SYSTEM_MAC      1
    #define SYSTEM_NAME     "MacOS"
#else
    #define SYSTEM_MAC      0
#endif

#if !defined(__ANDROID__) && defined (__gnu_linux__)
    #define SYSTEM_LINUX    1
    #define SYSTEM_GNULINUX 1
    #define SYSTEM_NAME     "GNU/Linux"
#else
    #define SYSTEM_LINUX    0
    #define SYSTEM_GNULINUX 0
#endif

#if !defined(SYSTEM_NAME)
    #error "System identification failed (or not supported) !"
#endif


// NOTE: This header contains type definitions

#include <stdint.h>


// Integer types
// Unsigned
typedef uint64_t    u64;
typedef uint32_t    u32;
typedef uint16_t    u16;
typedef uint8_t     u8;

#define U64_MAX UINT64_MAX
#define U32_MAX UINT32_MAX
#define U16_MAX UINT16_MAX
#define U8_MAX  UINT8_MAX

// Signed
typedef int64_t    i64;
typedef int32_t    i32;
typedef int16_t    i16;
typedef int8_t     i8;

#define I64_MAX INT64_MAX
#define I32_MAX INT32_MAX
#define I16_MAX INT16_MAX
#define I8_MAX  INT8_MAX

// Floating point
typedef float     f32;
typedef double    f64;

// Boolean
typedef int8_t    b8;
#define TRUE  1
#define FALSE 0

// Check type sizes
STATIC_ASSERT(sizeof(u64) == 8, "u64 size is wrong.");
STATIC_ASSERT(sizeof(u32) == 4, "u32 size is wrong.");
STATIC_ASSERT(sizeof(u16) == 2, "u16 size is wrong.");
STATIC_ASSERT(sizeof(u8) == 1, "u8 size is wrong.");

STATIC_ASSERT(sizeof(i64) == 8, "i64 size is wrong.");
STATIC_ASSERT(sizeof(i32) == 4, "i32 size is wrong.");
STATIC_ASSERT(sizeof(i16) == 2, "i16 size is wrong.");
STATIC_ASSERT(sizeof(i8) == 1, "i8 size is wrong.");

STATIC_ASSERT(sizeof(f32) == 4, "f32 size is wrong.");
STATIC_ASSERT(sizeof(f64) == 8, "f64 size is wrong.");

STATIC_ASSERT(sizeof(b8) == 1, "b8 size is wrong.");
STATIC_ASSERT(TRUE, "True has wrong value.");
STATIC_ASSERT(!FALSE, "False has wrong value.");


enum memory_alloc_tag
{
    // Fixed tags, they should stay here as they are necessary to the base layer
    MEMORY_TAG_UNKNOWN,
    MEMORY_TAG_DARRAY,
    MEMORY_TAG_STRING,
    MEMORY_TAG_FIO_DATA, // Allocated data used to store File inputs temporarly in memory (read_file)

    // Free tags, those can be anything
    MEMORY_TAG_RENDERER,    // Allocated data used by the renderer for it to work
    MEMORY_TAG_RENDER_DATA, // Allocated data exploited by the renderer (Voxel data for example, textures ...)

    // Tag count
    MEMORY_TAG_COUNT,
};

__attribute__( (unused) ) static char *memory_alloc_tag_names[MEMORY_TAG_COUNT] =
{
    // Fixed tags, they should stay here as they are necessary to the base layer
    "MEMORY_UNKNOWN    ",
    "MEMORY_DARRAY     ",
    "MEMORY_STRING     ",
    "MEMORY_FIO_DATA   ",

